Дошкольное_учреждение83/src/Catalogs/удуРеестрыОтправки/удуРеестрыОтправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуРеестрыОтправки</name>
  <attributes>
    <name>ТипРеестра</name>
    <type>
      <types>CatalogRef.удуТипыРеестров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.удуСтатусОтправки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоставки</name>
    <type>
      <types>CatalogRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>CatalogRef.ИсходящиеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПакета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пакеты</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Корреспондент</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПовторныеПакеты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Enums/удуСтатусОтправки/удуСтатусОтправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуСтатусОтправки</name>
  <enumValues>
    <name>Текущий</name>
  </enumValues>
  <enumValues>
    <name>Закрытый</name>
  </enumValues>
  <enumValues>
    <name>Отправленный</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Catalogs/удуРеестрыОтправки/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Текущие = Истина;
	Закрытые = Ложь;
	Отправленные = Ложь;
	УстановитьОтбор();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтборСтатус = Перечисления.удуСтатусОтправки.Текущий;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор()
	
	ПараметрыОтбора = Новый Соответствие();
	Параметрыотбора.Вставить("Статус",ОтборСтатус);
	ПараметрыОтбора.Вставить("ВидДоставки", ОтборВидДоставки);
	УстановитьОтборСписка(Список, ПараметрыОтбора);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Список, ПараметрыОтбора)
	
	ЭлементыОтбора = Список.Отбор.Элементы;
	 
	Если Не ЗначениеЗаполнено(ПараметрыОтбора["Статус"]) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьОтборУСписка(Список.Отбор,
			Новый ПолеКомпоновкиДанных("Статус"));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаНаРавенство(
			Список.Отбор,
			Новый ПолеКомпоновкиДанных("Статус"),
			ПараметрыОтбора["Статус"]);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыОтбора["ВидДоставки"]) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьОтборУСписка(Список.Отбор,
			Новый ПолеКомпоновкиДанных("ВидДоставки"));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаНаРавенство(
			Список.Отбор,
			Новый ПолеКомпоновкиДанных("ВидДоставки"),
			ПараметрыОтбора["ВидДоставки"]);
	КонецЕсли;

			
КонецПроцедуры


&НаКлиенте
Процедура ОтборВидДоставкиПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры
